RIET/src/Reports/ДекларацияОКоличествеТоваровПодлежащихУтилизации/ДекларацияОКоличествеТоваровПодлежащихУтилизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ДекларацияОКоличествеТоваровПодлежащихУтилизации</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
</mdclass:Report>

RIET/src/InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Поле1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле6</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле7</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле8</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле9</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле10</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПользовательЛичногоКонтакта</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Documents/ЗакрытиеПоставки/ЗакрытиеПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеПоставки</name>
  <basedOn>Document.Поставка</basedOn>
  <basedOn>Document.ExportShipment</basedOn>
  <basedOn>Document.TemporaryImpExpTransactions</basedOn>
  <registerRecords>AccumulationRegister.ExportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>InformationRegister.CustomsFilesOfGoods</registerRecords>
  <registerRecords>AccumulationRegister.QtyOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>InformationRegister.ExpiryDatesOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>InformationRegister.AdditionalDataOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.ImportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>InformationRegister.ResponsiblesForItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceLinesCosts</registerRecords>
  <attributes>
    <name>Поставка</name>
    <type>
      <types>DocumentRef.TemporaryImpExpTransactions</types>
      <types>DocumentRef.ExportShipment</types>
      <types>DocumentRef.Поставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретОбменаРИЕТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сопоставление</name>
    <attributes>
      <name>СтрокаИнвойса</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварСтрокиГТД</name>
      <type>
        <types>CatalogRef.ТоварыСтрокГТД</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Catalogs/ПодразделенияОрганизаций/ПодразделенияОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодразделенияОрганизаций</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйОрган</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Location</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПодразделения</name>
    <type>
      <types>EnumRef.ВидПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерПФР</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодИМНС</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальныеУсловияПФР</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ТерриториальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПлательщикаПриПеречисленииНалогов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИностраннаяОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКОПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоНаименованиеОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоКодОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <comment>Заполняется в случае, если организация не российская</comment>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПостоянногоМестонахождения</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВСтранеРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИнострОрганизации</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерФСС</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИМНС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОНХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйПредприниматель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислениеАмортизацииОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GeoMarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменЗадействован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКодАбонента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКаталогОтправкиДанныхОтчетности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКаталогПрограммыЭлектроннойПочты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИФНСПолучателя</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЗаказчика</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalEntity</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>rgsКонтрагент</name>
    <comment>Контрагент</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Reports/ДекларацияОКоличествеТоваровПодлежащихУтилизации/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.Период = НачалоГода(ТекущаяДата());
	ДатаФормирования = ТекущаяДата();
	ТаблицаНомеров.Область("R" + Формат(1, "ЧГ=0") + "C1").Текст  = "Строка инвойса";
	ТаблицаНомеров.Область("R" + Формат(1, "ЧГ=0") + "C2").Текст  = "Номер ГТД";
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере(ТабДок)
	Объект = РеквизитФормыВЗначение("Отчет");
	ДанныеШапки = ПолучитьДанныеШапки ();
	ДанныеТЧ = ПолучитьДанныеТЧ();
	
	Макет = Объект.ПолучитьМакет("ФормаОтчета");
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаШапка.Параметры.ОтчетныйГод = Год(Отчет.Период);
	Если ДанныеШапки.Количество() Тогда 
		ОбластьМакетаШапка.Параметры.Заполнить(ДанныеШапки[0]);
	КонецЕсли;
	ТабДок.Вывести(ОбластьМакетаШапка);
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц(); 
	
	ОбластьМакетаЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ТабДок.Вывести(ОбластьМакетаЗаголовокТаблицы);
	
	ОбластьМакетаШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДок.Вывести(ОбластьМакетаШапкаТаблицы);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	НомерСтроки = 1;
	Для Каждого Строка Из ДанныеТЧ Цикл 
		ОбластьМакета.Параметры.Заполнить(Строка);
		ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
		Если Цел(Строка.ВесНетто) = Строка.ВесНетто Тогда 
			ОбластьМакета.Параметры.ВесНетто = Строка.ВесНетто;
		Иначе
			ОбластьМакета.Параметры.ВесНетто = Цел(Строка.ВесНетто) + 1;
		КонецЕсли;
		МассивОбластей = Новый Массив;
		Если НомерСтроки = 1 Тогда 
			МассивОбластей.Добавить(ОбластьМакетаШапка);
			МассивОбластей.Добавить(ОбластьМакетаШапкаТаблицы);
		КонецЕсли;
		МассивОбластей.Добавить(ОбластьМакета);
		Если ТабДок.ПроверитьВывод(МассивОбластей)Тогда 
			ТабДок.Вывести(ОбластьМакета);
		Иначе 
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДок.Вывести(ОбластьМакетаШапкаТаблицы);
			ТабДок.Вывести(ОбластьМакета);
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакетаПодвал.Параметры.Подписант = Подписант;
	ОбластьМакетаПодвал.Параметры.ДатаФормирования = Строка(Формат(ДатаФормирования,"ДФ=dd.MM.yyyy")) + " г."; 
	ТабДок.Вывести(ОбластьМакетаПодвал);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ЭкземпляровНаСтранице = 1;
	ТабДок.РазмерСтраницы = "A4";
	ПолучитьНомераГТД();
	Если НомераГТД.Количество() Тогда 
		СформироватьНаСервере(ТабДок);
	КонецЕсли;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ВерхнийКолонтитул.НачальнаяСтраница = 1;
	ТабДок.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	ТабДок.ВерхнийКолонтитул.ТекстВЦентре = "стр. [&НомерСтраницы] из [&СтраницВсего]";
	ТабДок.ВерхнийКолонтитул.Выводить = Истина;
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Функция  ПолучитьДанныеТЧ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НомераГТД.НомерГТД КАК НомерГТД,
	|	НомераГТД.СтрокаИнвойса
	|ПОМЕСТИТЬ НомераГТД
	|ИЗ
	|	&НомераГТД КАК НомераГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗакрытиеПоставкиСопоставление.СтрокаИнвойса.SoldTo КАК SoldTo,
	|	СУММА(ЗакрытиеПоставкиСопоставление.ТоварСтрокиГТД.Количество) КАК Количество,
	|	ЗакрытиеПоставкиСопоставление.ТоварСтрокиГТД.Владелец.КодТНВЭД КАК КодТНВЭД,
	|	ЗакрытиеПоставкиСопоставление.ТоварСтрокиГТД.Владелец.ТНВЭД КАК ТНВЭД,
	|	ВЫРАЗИТЬ(ЗакрытиеПоставкиСопоставление.ТоварСтрокиГТД.Владелец.ОписаниеТовара КАК СТРОКА(150)) КАК НаименованиеТовара,
	|	НомераГТД.НомерГТД
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	Документ.ЗакрытиеПоставки.Сопоставление КАК ЗакрытиеПоставкиСопоставление
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ПодразделенияОрганизаций.LegalEntity.ParentCompany КАК LegalEntityParentCompany
	|		ИЗ
	|			Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|		ГДЕ
	|			ПодразделенияОрганизаций.ИНН = &ИНН
	|			И НЕ ПодразделенияОрганизаций.LegalEntity.ParentCompany ЕСТЬ NULL) КАК ВложенныйЗапрос
	|		ПО ЗакрытиеПоставкиСопоставление.СтрокаИнвойса.SoldTo = ВложенныйЗапрос.LegalEntityParentCompany
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераГТД КАК НомераГТД
	|		ПО ЗакрытиеПоставкиСопоставление.ТоварСтрокиГТД.Владелец.ГТД.Номер = НомераГТД.НомерГТД
	|			И ЗакрытиеПоставкиСопоставление.СтрокаИнвойса.Наименование = НомераГТД.СтрокаИнвойса
	|ГДЕ
	|	ЗакрытиеПоставкиСопоставление.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЗакрытиеПоставкиСопоставление.ТоварСтрокиГТД.Владелец.ТНВЭД.DisposableGoods = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗакрытиеПоставкиСопоставление.ТоварСтрокиГТД.Владелец.КодТНВЭД,
	|	ЗакрытиеПоставкиСопоставление.ТоварСтрокиГТД.Владелец.ТНВЭД,
	|	ЗакрытиеПоставкиСопоставление.СтрокаИнвойса.SoldTo,
	|	ВЫРАЗИТЬ(ЗакрытиеПоставкиСопоставление.ТоварСтрокиГТД.Владелец.ОписаниеТовара КАК СТРОКА(150)),
	|	НомераГТД.НомерГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблица.SoldTo,
	|	ИтоговаяТаблица.КодТНВЭД,
	|	ИтоговаяТаблица.ТНВЭД,
	|	ИтоговаяТаблица.НаименованиеТовара,
	|	СУММА(СтрокиГТД.ВесНетто) КАК ВесНетто
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтрокиГТД КАК СтрокиГТД
	|		ПО ИтоговаяТаблица.ТНВЭД = СтрокиГТД.ТНВЭД
	|			И ИтоговаяТаблица.НомерГТД = СтрокиГТД.ГТД.Номер
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтоговаяТаблица.SoldTo,
	|	ИтоговаяТаблица.КодТНВЭД,
	|	ИтоговаяТаблица.НаименованиеТовара,
	|	ИтоговаяТаблица.ТНВЭД";
	
	Запрос.УстановитьПараметр("НомераГТД", НомераГТД.Выгрузить()); 
	Запрос.УстановитьПараметр("ИНН", Отчет.ПодразделениеОрганизации.ИНН);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Отчет.Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецГода(Отчет.Период));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция  ПолучитьДанныеШапки()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодразделенияОрганизаций.Наименование,
	|	ПодразделенияОрганизаций.НаименованиеПолное,
	|	ПодразделенияОрганизаций.ИНН,
	|	ПодразделенияОрганизаций.КПП,
	|	ПодразделенияОрганизаций.КодОКВЭД,
	|	ПодразделенияОрганизаций.КодПоОКАТО,
	|	ПодразделенияОрганизаций.КодПоОКТМО,
	|	ПодразделенияОрганизаций.ОГРН,
	|	ПодразделенияОрганизаций.СвидетельствоСерияНомер,
	|	ПодразделенияОрганизаций.СвидетельствоНаименованиеОргана,
	|	Адреса.Представление КАК ЮрАдрес,
	|	Телефоны.Представление КАК Телефон
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК Телефоны
	|		ПО ПодразделенияОрганизаций.Ссылка = Телефоны.Объект
	|			И (Телефоны.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.ТелефонОрганизации))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК Адреса
	|		ПО ПодразделенияОрганизаций.Ссылка = Адреса.Объект
	|			И (Адреса.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
	|ГДЕ
	|	ПодразделенияОрганизаций.Ссылка = &Подразделение";
	
	Запрос.УстановитьПараметр("Подразделение", Отчет.ПодразделениеОрганизации);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции

&НаКлиенте
Функция ПолучитьНомераГТД() 
	
	НомерСтроки = 2;
	НомерГТД = СокрЛП(ТаблицаНомеров.Область("R" + НомерСтроки + "C2").Текст); 
	Пока ЗначениеЗаполнено(НомерГТД) Цикл
	    НоваяСтр = НомераГТД.Добавить();
		НоваяСтр.НомерГТД = НомерГТД;
		// { RGS LFedotova 04.05.2017 21:22:14 - вопрос S-I-0003036
		//СтрокаИнвойса = СокрЛП(ТаблицаНомеров.Область("R" + НомерСтроки + "C1").Текст); 
		СтрокаИнвойса = СокрЛП(ТаблицаНомеров.Область("R" + СтрЗаменить(НомерСтроки,Символы.НПП,"") + "C1").Текст); 
		// } RGS LFedotova 04.05.2017 21:23:47 - вопрос S-I-0003036 
		СтрокаИнвойса = СокрЛП(ТаблицаНомеров.Область("R" + СтрЗаменить(НомерСтроки,Символы.НПП,"") + "C1").Текст); 
		НоваяСтр.СтрокаИнвойса = СтрокаИнвойса;
		НомерСтроки = НомерСтроки + 1;
		// { RGS LFedotova 04.05.2017 21:24:34 - вопрос S-I-0003036
		//НомерГТД = СокрЛП(ТаблицаНомеров.Область("R" + НомерСтроки + "C2").Текст);
		НомерГТД = СокрЛП(ТаблицаНомеров.Область("R" + СтрЗаменить(НомерСтроки,Символы.НПП,"") + "C2").Текст);
		// } RGS LFedotova 04.05.2017 21:24:41 - вопрос S-I-0003036 
	КонецЦикла;
	
КонецФункции
